<?php
#const
# تستخدم لتعريف ثوابت في الصف حيث تعتبر ثابته ولايمكن تغيير قيمتها بعج تعريفها 
# يتم تعريفها باستخدام الكلمه الثابته ولاتحتاج الى استخدام $ في اسمها (const)
# يمكن الوصول اليها من داخل الفئه  وكذلك من خارج الفئه  باستخدام اسم الفئه


class MethConstent{

const pi=3.14;

}

echo MethConstent::pi;


#***************************************************************************
#static
#تستخدم لتعريف خصائص او دوال ثابته في الفئه التي تتعلق بالفئه نفسها بدلاً من كائن معين 
# يتم تعريفها باستخدام الكلمه الاساسيه (static)
#يمكن ان تكون الخصائص او الدوال الثابته مما يعين انه يمكن الوصول اليها دون الحاجه الى انشاء كائن من الفئه 
# يمكن الوصول اليها من داخل الفئه ومن خرج الفئه باستخدام اسم الفئه 

 class Counter{

public static $count=0;
public static function increment(){
self::$count++;

}
 }

 Counter::increment();
 echo "</br>********************</br>";
 echo Counter::$count."</br>********************</br>";

Counter::increment();
echo Counter::$count."</br>********************</br>";
