<?php
# تستخدم للحصو لعلى الوقت الحالي بحسب المنطقه الزمنيه المسنده 
echo time();

#************************************************************
#داله تطبع الوقت والتاريخ الحالي  بالسنه والشهر واليوم  والوقت بالساعه والدقيقه والثانيه 
 echo date('Y-m-d H:i:s')."</br>********************</br>";

 #************************************************************

 #تستخدم لتحويل سلسه نصيه الى توقيت زمني 
 
 echo strtotime("2024-06-17 2:10:10")."</br>********************</br>";

#************************************************************
#تستخدم لانشاء توقيت زمني من مكونات التاريخ (السنه،الشهر، اليوم، الساعه، الدقيقه، الثانيه)
$time=mktime(11 ,30,00,20,01,2025);
var_dump( $time)."</br>********************</br>";

#************************************************************
# عباره عن داله ترجع مصفوفه تحتوي على معلومات المتعلقه بالتاريخ والوقت الحاليين 
print_r(getdate())."</br>********************</br>";

#************************************************************
# داله تستخدم للانشاء  كائن يحتوي على تاريخ والوقت 
 $date1=date_create("2025-01-20 20:30:00");
 echo date_format($date1,'Y-m-d h:i:s')."</br>********************</br>";

 #************************************************************
 # داله تستخدم لتعديل التاريخ 
 
 $date2=date_create("2025-01-20");
date_modify($date2,'+1 month');

echo date_format($date2,'Y-m-d ')."</br>********************</br>";

#************************************************************
#  داله تحسب الفرق بين تاريخين بالايام  
$dates1=date_create("2025-01-20 ");
$dates2=date_create("2002-06-09");
$diff=date_diff($dates1,$dates2);
echo $diff->days ;
echo "</br>********************</br>";

#************************************************************

#داله تحقق مما اذا كانت قيم السنه والشهر واليوم تمثل تاريخاً صحيحاً 
 if(checkdate(20,1,2020)){
echo" the date is true ";
echo "</br>********************</br>";
}
else{
    echo" the date is false ";
    echo "</br>********************</br>";
 }
 #************************************************************
 # عباره عن داله تستخدم لعرض التاريخ والوقت وفقاً لاعدادت محليه 
 #D -- تعرض التاريخ كامل بالارقام
 #d -- تعرض اليوم فقط بالارقام 
 
 
 setlocale(LC_TIME,'ar_SA.utf8');
 echo strftime("%A,%D,%B %Y")."</br>********************</br>";

 #************************************************************
# تستخدم لانشاء كائن فاصل زمني من سلسه نصيه 
 $det1=date_interval_create_from_date_string("5 month");

 echo $det1->m."</br>********************</br>";

 #************************************************************
 #  داله تستخدم لطرح فترات زمنيه الى كائن التوجيهه
 $det2=date_create("2025-01-20");
 date_sub($det2,date_interval_create_from_date_string("1 month"));
 echo date_format($det2,"Y-m-d")."</br>********************</br>";

 #************************************************************
 # داله تستخدم لاضافه فترات زمنيه الى كائن التاريخ 
 $det3=date_create("2025-01-20");
 date_add($det3,date_interval_create_from_date_string("3 month"));
 echo date_format($det3,"Y-m-d")."</br>********************</br>";

 #************************************************************
# داله تستخدم بتنسيق كائن التاريخ حيث تاخذ كائن تاريخ وتنسيقاً زتعيد التاريخ بالتنسيق المحدد
 $det4=date_create("2025-01-20");
 echo date_format($det4,"d/m/y")."</br>********************</br>";
 
 #************************************************************