<?php
echo "<h1><div style='color: black;  text-align: center;border: 8px rgb(61, 61, 161) ridge; padding: 10px;margin: 40px; box-shadow: 10px 10px 9px rgb(174, 174, 162);'> &#34دوال المصفوفات كامله</div></h1>";
// دوال المصفوفات كامله 
// 1-الداله الاوله تسختدم في دمج مصفوفتين او اكثر 
echo"<h4 style='color: black;  text-align: left;'>1-الداله  تسختدم في دمج مصفوفتين او اكثر :</h4>";

$fr=['s','h','a','i','m','a'];
$se=['a','l','m','a','q','t','r','y'];
$result=array_merge($fr,$se);
print_r($result);
echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//****************************************************************************************************_^/
//2- داله استخراج جزء من النص
echo"<h4 style='color: black;  text-align: left;'>2- داله استخراج جزء من النص:</h4>";
$slice=array_slice($fr,1,3);
 print_r($slice);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
 echo"</br></br>";


//****************************************************************************************************_^/
 //3-داله تطبيق داله على كل عنصر من عناصر المصفوفه 
 echo"<h4 style='color: black;  text-align: left;'>3-داله تطبيق داله على كل عنصر من عناصر المصفوفه :</h4>";
$numbers=[1,2,3,4,5,6,7];
 $squared=array_map(fn($n)=>$n**2,$numbers);
print_r($squared);
echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//*****************************************************************************************************_^/
//4- تصفيه المصفوفات بناء على داله
echo"<h4 style='color: black;  text-align: left;'>4- تصفيه المصفوفات بناء على داله:</h4>";
$evens=array_filter($numbers,fn($n)=>$n%2===0);
 print_r( $evens);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";



//******************************************************************************************************_^/
//5- تقليل المصفوفه الى قيمة واحده
echo"<h4 style='color: black;  text-align: left;'>5- تقليل المصفوفه الى قيمة واحده:</h4>";
$sum=array_reduce($numbers,fn($carry,$item)=>$carry+$item,0);
 print_r($sum);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//  دوال جديده تمت اضافتها 
//6-داله تعمل على تحديد ما اذا كانت المصفوفه قائمه (تبدا من الصفر بدون فراغات)
echo"<h4 style='color: black;  text-align: left;'>6-داله تعمل على تحديد ما اذا كانت المصفوفه قائمه (تبدا من الصفر بدون فراغات):</h4>";
var_dump(array_is_list($numbers));

echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//7- داله استرجاع اول واحر مفتاح في المصفوفه
echo"<h4 style='color: black;  text-align: left;'>7- داله استرجاع اول واحر مفتاح في المصفوفه:</h4>";
$var1=['s'=>1,'h'=>2];
$firstKey=array_key_first($var1);
print_r($firstKey);
echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//8- داله لانشاء مصفوفه جديده 
echo"<h4 style='color: black;  text-align: left;'>8- داله لانشاء مصفوفه جديده :</h4>";
$var2=array(1,2,3);
 print_r( $var2);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
 echo"</br></br>";


 //******************************************************************************************************_^/
 //9- داله تغيير حالة مفاتيح المصفوفه 
 echo"<h4 style='color: black;  text-align: left;'>9- داله تغيير حالة مفاتيح المصفوفه :</h4>";
 $var3=['s'=>'smile','h'=>'honey'];
  $chang=array_change_key_case($var3,CASE_LOWER);
  print_r($chang);
  echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//10- داله تقسيم المصفوفه الى مصفوفات فرعيه 
echo"<h4 style='color: black;  text-align: left;'>10- داله تقسيم المصفوفه الى مصفوفات فرعيه :</h4>";
$chunk=array_chunk($numbers,2);
print_r( $chunk);
echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//11- داله استرجاع مجموعه من القيم من عمود معين
echo"<h4 style='color: black;  text-align: left;'>11- داله استرجاع مجموعه من القيم من عمود معين:</h4>";
$var4=[['id'=>1,'name'=>'shaimaa'],['id'=>2,'name' =>'faroq']];
 $names=array_column($var4,'name');
 print_r( $names);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//12- داله دمج مصفوفيتن من اجل انشاء مصفوفه جديده
echo"<h4 style='color: black;  text-align: left;'>12- داله دمج مصفوفيتن من اجل انشاء مصفوفه جديده:</h4>";
$value=[1,2,3,4,5,6];
$combines=array_combine($fr,$value);
 print_r($combines);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
 echo"</br></br>";


 //******************************************************************************************************_^/
 //13- داله تعد  القيم داخل مصفوفه
 echo"<h4 style='color: black;  text-align: left;'>13- داله تعد  القيم داخل مصفوفه:</h4>";
 $count=array_count_values($fr);
  print_r($count);
  echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
  //14- داله تعيد القيم الموجوده في مصفوفه ولا توجد في مصفوفه اخرى
  echo"<h4 style='color: black;  text-align: left;'>14- داله تعيد القيم الموجوده في مصفوفه ولا توجد في مصفوفه اخرى:</h4>";
  $diff=array_diff($fr,$se);
   print_r($diff);
   echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//15-داله تعمل على ملء المصفوفه بقيم معينه 
echo"<h4 style='color: black;  text-align: left;'>15-داله تعمل على ملء المصفوفه بقيم معينه :</h4>";
$fill=array_fill(0,5,'hello ');
 print_r($fill);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//16- داله تبديل المفاتيح والقيم في المصفوفه 
echo"<h4 style='color: black;  text-align: left;'>16- داله تبديل المفاتيح والقيم في المصفوفه :</h4>";
$filp=array_flip($var1);
 print_r($filp);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
 echo"</br></br>";


 //******************************************************************************************************_^/
 //17- داله العثور على قيم مشتركه بين المصفوفتين
 echo"<h4 style='color: black;  text-align: left;'>17- داله العثور على قيم مشتركه بين المصفوفتين:</h4>";
 $imtersect=array_intersect($fr,$se);
  print_r( $imtersect);
  echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
  echo"</br></br>";


  //******************************************************************************************************_^/
  //18- داله تعمل على ترتيب المصفوفات بشكل تصاعدي 
  echo"<h4 style='color: black;  text-align: left;'>18- داله تعمل على ترتيب المصفوفات بشكل تصاعدي :</h4>";
  $num=[1,2,3];
   $multisort=array_multisort($num);
   print_r( $multisort);
   echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//19- ازاله عنصر من اخر المصفوفه
echo"<h4 style='color: black;  text-align: left;'>19- ازاله عنصر من اخر المصفوفه:</h4>";
$pop=array_pop($num);
 print_r($pop);

 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//20-داله اضافه عنصر الى داخل المصفوفه 
echo"<h4 style='color: black;  text-align: left;'>20-داله اضافه عنصر الى داخل المصفوفه :</h4>";
$pushs=array_push($num,4,5,6);
print_r($pushs);
echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//21- داله اضافه عنصر او اكثر الى بداية المصفوفه
echo"<h4 style='color: black;  text-align: left;'>21- داله اضافه عنصر او اكثر الى بداية المصفوفه:</h4>";
$unshift=array_unshift($num,6);
 var_dump($unshift);
 echo"</br></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
 //22- داله ازاله عنصر من بدايه المصفوفه
 echo"<h4 style='color: black;  text-align: left;'>22- داله ازاله عنصر من بدايه المصفوفه:</h4>";
 $shift=array_shift($num);
 print_r( $shift);
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/

//السلاسل النصيه 
echo "<h1><div style='color: black;  text-align: center;border: 8px rgb(61, 61, 161) ridge; padding: 10px;margin: 40px; box-shadow: 10px 10px 9px rgb(174, 174, 162);'> &#34السلاسل النصيه كامله </div></h1>";                                               
//الحصول على طول السلسله النصيه 
echo"<h4 style='color: black;  text-align: left;'>الحصول على طول السلسله النصيه :</h4>";
$str="shaima'a Almaqtry";
 $lenght=strlen($str);
 echo $lenght;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// البحث عن  موضع اول ظهور للاحرف في السلسه
echo"<h4 style='color: black;  text-align: left;'>البحث عن  موضع اول ظهور للاحرف في السلسه:</h4>";
$position=strpos($str,"A");
echo $position;
echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// استبدال جزء من السلسه بنص اخر 
echo"<h4 style='color: black;  text-align: left;'>استبدال جزء من السلسه بنص اخر :</h4>";
$newstr=str_replace("Almaqtry" , "Faroq",$str);
 echo $newstr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//استخراج جزء من السلسله 
echo"<h4 style='color: black;  text-align: left;'>استخراج جزء من السلسله :</h4>";
$substr=substr($str ,8,9);
 echo $substr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تحويل السلسله الى حروف كبيره 
echo"<h4 style='color: black;  text-align: left;'>تحويل السلسله الى حروف كبيره :</h4>";
$upperstr=strtoupper($str);
 echo  $upperstr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تحويل السلسله الى حروف صغيره
echo"<h4 style='color: black;  text-align: left;'>تحويل السلسله الى حروف صغيره:</h4>";
$lowerstr=strtolower($str);
 echo  $lowerstr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//  ازاله المسافات البيضاء من البدايه  والنهايه
echo"<h4 style='color: black;  text-align: left;'>ازاله المسافات البيضاء من البدايه  والنهايه:</h4>";
$trimmedstr=trim($str);
 echo $trimmedstr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تقسيم السلسله الى مصفوفه باستخدام فاصل محدد
echo"<h4 style='color: black;  text-align: left;'>تقسيم السلسله الى مصفوفه باستخدام فاصل محدد:</h4>";
$str2="shaima'a,Faroq,Almaqtry";
$array=explode(",",$str2);
 print_r( $array);
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//دمج عناصر المصفوفه الى سلسله باستخدام فاصل محدد
echo"<h4 style='color: black;  text-align: left;'>دمج عناصر المصفوفه الى سلسله باستخدام فاصل محدد:</h4>";
$str3=["shaima","Faroq","Almaqtry"];
 $array2=implode(" ",$str3);
 print_r($array2);
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تكرار السلسه عدد معين من المرات 
echo"<h4 style='color: black;  text-align: left;'>تكرار السلسه عدد معين من المرات :</h4>";
$repeatedstr=str_repeat($str ,3);
echo $repeatedstr ;
echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تحقق ما اذا كان السلسله تحتوي على نص معين 
echo"<h4 style='color: black;  text-align: left;'>تحقق ما اذا كان السلسله تحتوي على نص معين :</h4>";
$contains=str_contains($str,"shaima'a");
var_dump($contains);
echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تحقق ما اذا كانت السلسله تبدا بنص معين 
echo"<h4 style='color: black;  text-align: left;'>تحقق ما اذا كانت السلسله تبدا بنص معين :</h4>";
$startswith=str_starts_with($str,"shaima'a");
var_dump ($startswith);
echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// //تنسيق السلسله
//  $age=21;
// //  $sprint=("my name is %s and i am %a years old."$str,$age);
//  echo $sprint;
//  echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
// echo"</br></br>";


//******************************************************************************************************_^/
// تحويل الاحرف الخاصه الى كود  html
echo"<h4 style='color: black;  text-align: left;'>تحويل الاحرف الخاصه الى كود  html:</h4>";
$htm="<html>";
$escapedstr=htmlspecialchars($htm);
echo $escapedstr;
echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//تحويل اول حرف من السلسله الى حرف كبير 
echo"<h4 style='color: black;  text-align: left;'>تحويل اول حرف من السلسله الى حرف كبير :</h4>";
$capitalizedstr=ucfirst ($str);
 echo $capitalizedstr;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
// تحويل اول حرف من كل كلمه الى حرف كبير
echo"<h4 style='color: black;  text-align: left;'> تحويل اول حرف من كل كلمه الى حرف كبير:</h4>";
$capita=ucwords($str);
 echo $capita;
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//تقسيم المصفوفه الى مصفوفه احر ف
echo"<h4 style='color: black;  text-align: left;'>تقسيم المصفوفه الى مصفوفه احر ف:</h4>";
$arrayletter=str_split($str);
 print_r($arrayletter);
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/
//مقارنة بين سلسلتين دون اعتبار لحاله الاحرف 
echo"<h4 style='color: black;  text-align: left;'>مقارنة بين سلسلتين دون اعتبار لحاله الاحرف :</h4>";
$equl=strcasecmp("shaimaa","SHAIMAA");
 var_dump($equl);
 echo"</br ></br><div style='color:rgb(61, 61, 161)';</div>**********************************************************";
echo"</br></br>";


//******************************************************************************************************_^/




























?>



